[
  {
    "id": 1,
    "title": "Coffee Curator",
    "description": "Coffee Curator is an interactive front-end application that utilizes Bootstrap for its UI and makes use of two server-side APIs to generate its dynamic content. It also employs client-side storage for persistent data, and features a responsive and polished user interface. \nThe application accesses properties of objects, processes data using AJAX calls, accesses data on RESTful web APIs, and generates page elements based on API responses. This demonstrates an ability to build a real-world front-end application that requires collaborative coding.",
    "image": "./coffee-curator.png",
    "link": "https://example.com/coffee-curator",
    "buttonText": "View Application"
  },
  {
    "id": 2,
    "title": "Workday Planner",
    "description": "This project is a dynamic work day planner enabling users to input their custom work hours and generate a planner for their work day. The planner consists of time blocks representing each hour of this work day, with text areas for the user to input notes for each hour.",
    "image": "../src/snowy-hills.jpg",
    "codeLink": "https://github.com/harrygarstang/Workday-Planner",
    "buttonText": "View Code"
  },
  {
    "id": 3,
    "title": "Project 3",
    "description": "Some quick example text to build on the card title and make up the bulk of the card's content.",
    "image": "../src/snowy-hills.jpg",
    "link": "#",
    "buttonText": "Coming Soon"
  },
  {
    "id": 4,
    "title": "Custom README Creator",
    "description": "This is a node.js command-line application that generates a README file based on user input using the Inquirer.js library for prompting the user with questions. The user is asked to provide information such as project title, description, installation requirments, usage instructions, license type, contribution guidelines, test instructions, and contact information.",
    "image": "../src/snowy-hills.jpg",
    "link": "https://github.com/harrygarstang/Custom-README-Creator",
    "buttonText": "View Code"
  },
  {
    "id": 5,
    "title": "Project 5",
    "description": "Some quick example text to build on the card title and make up the bulk of the card's content.",
    "image": "../src/snowy-hills.jpg",
    "link": "#",
    "buttonText": "Coming Soon"
  },
  {
    "id": 6,
    "title": "Project 6",
    "description": "Some quick example text to build on the card title and make up the bulk of the card's content.",
    "image": "../src/snowy-hills.jpg",
    "link": "#",
    "buttonText": "Coming Soon"
  }
]